package com.example.enums;

/**
 * Created by Administrator on 2017.04.24.
 */
public enum ErrorCodeEnum {
    E0000(0, "成功"),
    E0001(1, "参数错误"),
    E0002(2, "Token无效"),
    E0003(3, "系统保留错误代码，请勿占用"),
    E0004(4, "系统保留错误代码，请勿占用"),
    E0005(5, "系统保留错误代码，请勿占用"),
    E0006(6, "系统保留错误代码，请勿占用"),
    E0007(7, "系统保留错误代码，请勿占用"),
    E0008(8, "系统保留错误代码，请勿占用"),
    E0009(9, "系统保留错误代码，请勿占用"),
    E0010(10, "系统保留错误代码，请勿占用"),
    E0011(11, "用户不存在"),
    E0012(12, "用户已存在"),
    E0013(13, "用户ID不能为空"),
    E0014(14, "昵称不能为空"),
    E0015(15, "用户名不能为空"),
    E0016(16, "密码不能为空"),
    E0017(17, "确认密码不能为空"),
    E0018(18, "密码和确认密码不一致"),
    E0021(21, "公告不存在"),
    E0022(22, "公告已存在"),
    E0023(23, "公告ID不能为空"),
    E0024(24, "公告标题不能为空"),
    E0025(25, "公告图片不能为空"),
    E0026(26, "公告内容不能为空"),
    E0031(31, "视讯类型不存在"),
    E0032(32, "视讯类型已存在"),
    E0033(33, "视讯类型ID不能为空"),
    E0034(34, "视讯类型名称不能为空"),
    E0041(41, "视讯不存在"),
    E0042(42, "视讯已存在"),
    E0043(43, "视讯ID不能为空"),
    E0044(44, "视讯标题不能为空"),
    E0045(45, "视讯图片不能为空"),
    E0046(46, "视讯链接不能为空"),
    E0051(51, "活动不存在"),
    E0052(52, "活动已存在"),
    E0053(53, "活动ID不能为空"),
    E0054(54, "活动标题不能为空"),
    E0055(55, "活动图片不能为空"),
    E0056(56, "活动内容不能为空"),
    E0061(61, "申请流程图不存在"),
    E0062(62, "申请流程图已存在"),
    E0063(63, "申请流程图ID不能为空"),
    E0064(64, "申请流程图不能为空"),
    E0065(65, "最多只能添加一个申请流程图"),
    E0071(71, "申请流程步骤不存在"),
    E0072(72, "申请流程步骤已存在"),
    E0073(73, "申请流程步骤ID不能为空"),
    E0074(74, "申请流程步骤名称不能为空"),
    E0081(81, "公司不存在"),
    E0082(82, "公司已存在"),
    E0083(83, "公司ID不能为空"),
    E0084(84, "公司名称不能为空"),
    E0085(85, "公司描述不能为空"),
    E0086(86, "最多只能添加一个公司"),
    E0091(91, "公司证书不存在"),
    E0092(92, "公司证书已存在"),
    E0093(93, "公司证书ID不能为空"),
    E0094(94, "公司证书名称不能为空"),
    E0095(95, "公司证书图片不能为空"),
    E0101(101, "行业类型不存在"),
    E0102(102, "行业类型已存在"),
    E0103(103, "行业类型ID不能为空"),
    E0104(104, "行业类型名称不能为空"),
    E0111(111, "行业动态不存在"),
    E0112(112, "行业动态已存在"),
    E0113(113, "行业动态ID不能为空"),
    E0114(114, "行业动态标题不能为空"),
    E0115(115, "行业动态图片不能为空"),
    E0116(116, "行业动态链接不能为空"),
    E0121(121, "横幅不存在"),
    E0122(122, "横幅已存在"),
    E0123(123, "横幅ID不能为空"),
    E0124(124, "横幅名称不能为空"),
    E0125(125, "横幅图片不能为空"),;

    private int code;
    private String msg;

    public void setCode(int code) {
        this.code = code;
    }

    public int getCode() {
        return code;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public String getMsg() {
        return msg;
    }

    private ErrorCodeEnum(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }
}
